{"ACM_article_2888992": {"authors": [{"name": "Roy Williams", "id": "ACM_author_99658982109"}, {"name": "Scott Williams", "id": "ACM_author_99658982998"}, {"name": "Amar Das", "id": "ACM_author_99658982282"}], "title": "Using agent-based simulation to understand populatation dynamics and coevolution in host-pathogen relationships", "keywords": [], "year": 2015, "abstract": "The development of anti-biotic resistant strains of bacteria and the nearly annual emergence of new strains of influenza virus are evidence of the rapid adaptation of pathogens to environmental pressures. The ability to predict the outcome of a long-term host-pathogen interaction could significantly improve public health decisions. Starting from the"}, "ACM_article_3330362": {"authors": [{"name": "Haonan Wang", "id": "ACM_author_99659440364"}, {"name": "Mohamed Ibrahim", "id": "ACM_author_99659439034"}, {"name": "Sparsh Mittal", "id": "ACM_author_99659166080"}, {"name": "Adwait Jog", "id": "ACM_author_81502801417"}], "title": "Address-stride assisted approximate load value prediction in GPUs", "keywords": ["GPU", "approximation", "scheduling", "value prediction"], "year": 2019, "abstract": "Value prediction holds the promise of significantly improving the performance and energy efficiency. However, if the values are predicted incorrectly, significant performance overheads are observed due to execution rollbacks. To address these overheads, value approximation is introduced, which leverages the observation that the rollbacks are not necessary as long as"}, "ACM_article_3060412": {"authors": [{"name": "Lei Jiang", "id": "ACM_author_81456627387"}, {"name": "Sparsh Mittal", "id": "ACM_author_99659166080"}, {"name": "Wujie Wen", "id": "ACM_author_81502762457"}], "title": "Building a Fast and Power Efficient Inductive Charge Pump System for 3D Stacked Phase Change Memories", "keywords": ["3d stacking technology", "charge pumps", "phase change memory"], "year": 2017, "abstract": "Phase change memory emerges as one of the most promising alternatives to traditional DRAM in terabyte main memory constructions. 3D stacking technology further enhances the scalability and capacity of PCM. However, write bandwidth of emerging 3D stacked PCMs is seriously limited by capacitive change pump widely adopted in 2D PCM"}, "ACM_article_3062394": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A Survey of Techniques for Cache Partitioning in Multicore Processors", "keywords": ["QoS", "Review", "classification", "fairness", "multicore processor", "partitioning", "shared cache"], "year": 2017, "abstract": "As the number of on-chip cores and memory demands of applications increase, judicious management of cache resources has become not merely attractive but imperative. Cache partitioning, that is, dividing cache space between applications based on their memory demands, is a promising approach to provide capacity benefits of shared cache with"}, "ACM_article_3028948": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A Survey of Techniques for Architecting and Managing GPU Register File", "keywords": [], "year": 2017, "abstract": "To support their massively-multithreaded architecture, GPUs use very large register file (RF) which has a capacity higher than even L1 and L2 caches. In total contrast, traditional CPUs use tiny RF and much larger caches to optimize latency. Due to these differences, along with the crucial impact of RF in"}, "ACM_article_2994550": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A Survey of Techniques for Architecting Processor Components Using Domain-Wall Memory", "keywords": ["CPU", "GPU", "Review", "cache", "domain-wall memory", "energy", "performance", "reliability", "shift operations"], "year": 2016, "abstract": "Recent trends of increasing core-count and bandwidth/memory wall have motivated researchers to explore novel memory technologies for designing processor components such as cache, register file, shared memory, and so on. Domain-wall memory (DWM), also known as racetrack memory, is a promising emerging technology due to its non-volatility and very high"}, "ACM_article_2907071": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A Survey of Recent Prefetching Techniques for Processor Caches", "keywords": ["Review", "cache pollution", "classification", "data prefetching", "hardware (HW) prefetching", "helper thread prefetching", "instruction prefetching", "software (SW) prefetching", "speculative pre-execution"], "year": 2016, "abstract": "As the trends of process scaling make memory systems an even more crucial bottleneck, the importance of latency hiding techniques such as prefetching grows further. However, naively using prefetching can harm performance and energy efficiency and, hence, several factors and parameters need to be taken into account to fully realize"}, "ACM_article_2907321": {"authors": [{"name": "Panruo Wu", "id": "ACM_author_84458858957"}, {"name": "Dong Li", "id": "ACM_author_81461646385"}, {"name": "Zizhong Chen", "id": "ACM_author_81553684956"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}, {"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "Algorithm-Directed Data Placement in Explicitly Managed Non-Volatile Memory", "keywords": ["codesign", "hpc", "in-memory dma", "memory organization", "non volatile memory", "pcm", "phase change memory", "relaxed persistence"], "year": 2016, "abstract": "The emergence of many non-volatile memory (NVM) techniques is poised to revolutionize main memory systems because of the relatively high capacity and low lifetime power consumption of NVM. However, to avoid the typical limitation of NVM as the main memory, NVM is usually combined with DRAM to form a hybrid"}, "ACM_article_2902977": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}], "title": "Reducing Soft-error Vulnerability of Caches using Data Compression", "keywords": ["cache", "data compression", "fault-tolerance", "reliability", "resilience", "soft/transient error", "vulnerability"], "year": 2016, "abstract": "With ongoing chip miniaturization and voltage scaling, particle strike-induced soft errors present increasingly severe threat to the reliability of on-chip caches. In this paper, we present a technique to reduce the vulnerability of caches to soft-errors. Our technique uses data compression to reduce the number of vulnerable data bits in"}, "ACM_article_2858792": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A Survey of Techniques for Cache Locking", "keywords": ["classification", "Review", "multitasking", "CPU", "cache partitioning", "hard real-time system", "GPU", "cache locking", "worst-case execution time (WCET)"], "year": 2016, "abstract": "Cache memory, although important for boosting application performance, is also a source of execution time variability, and this makes its use difficult in systems requiring worst-case execution time (WCET) guarantees. Cache locking is a promising approach for simplifying WCET estimation and providing predictability, and hence, several commercial processors provide ability"}, "ACM_article_2927584": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}], "title": "A Survey of Software Techniques for Using Non-Volatile Memories for Storage and Main Memory Systems", "keywords": [], "year": 2016, "abstract": "Non-volatile memory (NVM) devices, such as Flash, phase change RAM, spin transfer torque RAM, and resistive RAM, offer several advantages and challenges when compared to conventional memory technologies, such as DRAM and magnetic hard disk drives (HDDs). In this paper, we present a survey of software techniques that have been"}, "ACM_article_2927579": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}], "title": "A Survey Of Architectural Approaches for Data Compression in Cache and Main Memory Systems", "keywords": [], "year": 2016, "abstract": "As the number of cores on a chip increases and key applications become even more data-intensive, memory systems in modern processors have to deal with increasingly large amount of data. In face of such challenges, data compression presents as a promising approach to increase effective memory system capacity and also"}, "ACM_article_2914123": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}], "title": "A Survey of Techniques for Modeling and Improving Reliability of Computing Systems", "keywords": [], "year": 2016, "abstract": "Recent trends of aggressive technology scaling have greatly exacerbated the occurrences and impact of faults in computing systems. This has made ‘reliability’ a first-order design constraint. To address the challenges of reliability, several techniques have been proposed. This paper provides a survey of architectural techniques for improving resilience of computing"}, "ACM_article_2893356": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A Survey of Techniques for Approximate Computing", "keywords": ["CPU", "FPGA", "GPU", "Review", "approximate computing technique (ACT)", "approximate storage", "classification", "neural networks", "quality configurability"], "year": 2016, "abstract": "Approximate computing trades off computation quality with effort expended, and as rising performance demands confront plateauing resource budgets, approximate computing has become not merely attractive, but even imperative. In this article, we present a survey of techniques for approximate computing (AC). We discuss strategies for finding approximable program portions and"}, "ACM_article_2871167": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A Survey of Architectural Techniques for Managing Process Variation", "keywords": ["3D processor", "CPU", "DRAM", "GPU", "Review", "core to core (C2C)", "delay and leakage variation", "die to die (D2D)", "nonvolatile memory (NVM)", "parametric variation", "resilience", "within die (WID)"], "year": 2016, "abstract": "Process variation—deviation in parameters from their nominal specifications—threatens to slow down and even pause technological scaling, and mitigation of it is the way to continue the benefits of chip miniaturization. In this article, we present a survey of architectural techniques for managing process variation (PV) in modern processors. We also"}, "ACM_article_2856125": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A Survey of Techniques for Architecting and Managing Asymmetric Multicore Processors", "keywords": ["Review", "asymmetric multicore processor", "big/little system", "classification", "heterogeneous multicore architecture", "reconfigurable AMP"], "year": 2016, "abstract": "To meet the needs of a diverse range of workloads, asymmetric multicore processors (AMPs) have been proposed, which feature cores of different microarchitecture or ISAs. However, given the diversity inherent in their design and application scenarios, several challenges need to be addressed to effectively architect AMPs and leverage their potential"}, "ACM_article_2821510": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A Survey of Architectural Techniques for Near-Threshold Computing", "keywords": ["reliability", "voltage scaling", "cache", "classification", "hard-error", "Review", "memory", "low-voltage", "near-threshold voltage computing (NT) (NTV) (NTC)"], "year": 2015, "abstract": "Energy efficiency has now become the primary obstacle in scaling the performance of all classes of computing systems. Low-voltage computing, specifically, near-threshold voltage computing (NTC), which involves operating the transistor very close to and yet above its threshold voltage, holds the promise of providing many-fold improvement in energy efficiency. However,"}, "ACM_article_2865956": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}], "title": "AYUSH: Extending Lifetime of SRAM-NVM Way-Based Hybrid Caches Using Wear-Leveling", "keywords": ["Non-volatile memory", "write-endurance", "write-minimization", "intra-set wear-leveling", "lifetime enhancement"], "year": 2015, "abstract": "The features and limitations of both SRAM and NVM (non-volatile memory) technologies have led the researchers to study SRAM-NVM way-based hybrid last level caches (LLCs). Since large leakage power consumption of SRAM allows including only few SRAM ways, the small write-endurance of NVM may still lead to small lifetime of"}, "ACM_article_2788396": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}], "title": "A Survey of CPU-GPU Heterogeneous Computing Techniques", "keywords": ["CPU-GPU heterogeneous/hybrid/collaborative computing", "dynamic/static load balancing", "fused CPU-GPU chip", "pipelining", "programming frameworks", "workload division/partitioning"], "year": 2015, "abstract": "As both CPUs and GPUs become employed in a wide range of applications, it has been acknowledged that both of these Processing Units (PUs) have their unique features and strengths and hence, CPU-GPU collaboration is inevitable to achieve high-performance computing. This has motivated a significant amount of research on heterogeneous"}, "ACM_article_2878664": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}], "title": "AYUSH: A Technique for Extending Lifetime of SRAM-NVM Hybrid Caches", "keywords": [], "year": 2015, "abstract": "Recently, researchers have explored way-based hybrid SRAM-NVM (non-volatile memory) last level caches (LLCs) to bring the best of SRAM and NVM together. However, the limited write endurance of NVMs restricts the lifetime of these hybrid caches. We present AYUSH, a technique to enhance the lifetime of hybrid caches, which works"}, "ACM_article_2757168": {"authors": [{"name": "Matt Poremba", "id": "ACM_author_81548031480"}, {"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Dong Li", "id": "ACM_author_81461646385"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}, {"name": "Yuan Xie", "id": "ACM_author_81100418590"}], "title": "DESTINY: a tool for modeling emerging 3D NVM and eDRAM caches", "keywords": ["PCM", "ReRAM", "SRAM", "STT-RAM", "cache", "eDRAM", "modeling tool", "non-volatile memory (NVM or NVRAM)", "validation"], "year": 2015, "abstract": "The continuous drive for performance has pushed the researchers to explore novel memory technologies (e.g. non-volatile memory) and novel fabrication approaches (e.g. 3D stacking) in the design of caches. However, a comprehensive tool which models both conventional and emerging memory technologies for both 2D and 3D designs has been lacking."}, "ACM_article_2683670": {"authors": [{"name": "Li Yu", "id": "ACM_author_81490681631"}, {"name": "Dong Li", "id": "ACM_author_81461646385"}, {"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}], "title": "Quantitatively modeling application resilience with the data vulnerability factor", "keywords": [], "year": 2014, "abstract": "Recent strategies to improve the observable resilience of applications require the ability to classify vulnerabilities of individual components (e.g., data structures, instructions) of an application, and then, selectively apply protection mechanisms to its critical components. To facilitate this vulnerability classification, it is important to have accurate, quantitative techniques that can"}, "ACM_article_2636342": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}], "title": "A Survey of Methods for Analyzing and Improving GPU Energy Efficiency", "keywords": ["GPU (graphics-processing unit)", "architecture techniques", "energy efficiency", "energy saving", "green computing", "power management", "power model"], "year": 2014, "abstract": "Recent years have witnessed phenomenal growth in the computational capabilities and applications of GPUs. However, this trend has also led to a dramatic increase in their power consumption. This article surveys research works on analyzing and improving energy efficiency of GPUs. It also provides a classification of these techniques on"}, "ACM_article_3201170": {"authors": [{"name": "Tore Pedersen", "id": "ACM_author_99659254105"}, {"name": "Christian Johansen", "id": "ACM_author_81472655691"}, {"name": "Audun JØsang", "id": "ACM_author_81100343007"}], "title": "Behavioural Computer Science: an agenda for combining modelling of human and system behaviours", "keywords": ["Artificial intelligence and trust", "Behavioural sciences", "Human aspect in technology", "Internet of Things", "Modelling", "Security ceremonies", "Ubiquitous computing"], "year": 2018, "abstract": "The rapidly increasing pervasiveness and integration of computers in human society calls for a broad discipline under which this development can be studied. We argue that to design and use technology one needs to develop and use models of humans and machines in all their aspects, including cognitive and memory"}, "ACM_article_3205840": {"authors": [{"name": "Allen Parrish", "id": "ACM_author_81100387338"}, {"name": "John Impagliazzo", "id": "ACM_author_81100469137"}, {"name": "Rajendra K. Raj", "id": "ACM_author_81100590340"}, {"name": "Henrique Santos", "id": "ACM_author_81452607122"}, {"name": "Muhammad Rizwan Asghar", "id": "ACM_author_81490646255"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Teresa Pereira", "id": "ACM_author_81474679274"}, {"name": "Vítor J. Sá", "id": "ACM_author_99659278678"}, {"name": "Eliana Stavrou", "id": "ACM_author_81467668170"}], "title": "Global perspectives on cybersecurity education", "keywords": ["ITiCSE working group", "computer security education", "cybersecurity education", "global standards", "information assurance education"], "year": 2018, "abstract": "Global cybersecurity crises have compelled universities to address the demand for educated cybersecurity professionals. As no shared framework for cybersecurity as an academic discipline exists, growthhas been unfocused and driven by training materials, which make it harder to create a common body of knowledge. An international perspective is still harder,"}, "ACM_article_3295778": {"authors": [{"name": "Allen Parrish", "id": "ACM_author_81100387338"}, {"name": "John Impagliazzo", "id": "ACM_author_81100469137"}, {"name": "Rajendra K. Raj", "id": "ACM_author_81100590340"}, {"name": "Henrique Santos", "id": "ACM_author_81452607122"}, {"name": "Muhammad Rizwan Asghar", "id": "ACM_author_81490646255"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Teresa Pereira", "id": "ACM_author_81474679274"}, {"name": "Eliana Stavrou", "id": "ACM_author_81467668170"}], "title": "Global perspectives on cybersecurity education for 2030: a case for a meta-discipline", "keywords": ["ITiCSE working group", "computer security education", "cybersecurity education", "global standards", "information assurance education"], "year": 2018, "abstract": "Information security has been an area of research and teaching within various computing disciplines in higher education almost since the beginnings of modern computers. The need for security in computing curricula has steadily grown over this period. Recently, with an emerging global crisis, because of the limitations of security within"}, "ACM_article_3279346": {"authors": [{"name": "Audun Josang", "id": "ACM_author_81100343007"}], "title": "Eccws 2018 - Proceedings of the 17th European Conference on Cyber Warfare and Security", "keywords": [], "year": 2018, "abstract": ""}, "ACM_article_3199490": {"authors": [{"name": "Vasileios Mavroeidis", "id": "ACM_author_99659282445"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "Data-Driven Threat Hunting Using Sysmon", "keywords": ["cyber threat intelligence", "sysmon", "threat assessment", "threat hunting"], "year": 2018, "abstract": "Threat actors can be persistent, motivated and agile, and they leverage a diversified and extensive set of tactics, techniques, and procedures to attain their goals. In response to that, organizations establish threat intelligence programs to improve their defense capabilities and mitigate risk. Actionable threat intelligence is integrated into security information"}, "ACM_article_3158409": {"authors": [{"name": "Kamer Vishi", "id": "ACM_author_87058677857"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "A new approach for multi-biometric fusion based on subjective logic", "keywords": ["belief fusion", "fingerprint", "iris recognition", "multimodal biometrics", "quality assessment", "subjective logic"], "year": 2017, "abstract": "Biometric verification systems have to address many practical requirements, such as performance, presentation attack detection (PAD), large population coverage, demographic diversity, and varied deployment environment. Traditional unimodal biometric systems do not fully meet the aforementioned requirements making them vulnerable and susceptible to different types of attacks. In response to that,"}, "ACM_article_3031657": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "Subjective Logic: A Formalism for Reasoning Under Uncertainty", "keywords": [], "year": 2016, "abstract": "This is the first comprehensive treatment of subjective logic and all its operations. The author developed the approach, and in this book he first explains subjective opinions, opinion representation, and decision-making under vagueness and uncertainty, and he then offers a full definition of subjective logic, harmonising the key notations and"}, "ACM_article_2989033": {"authors": [{"name": "Denis Migdal", "id": "ACM_author_99659081517"}, {"name": "Christian Johansen", "id": "ACM_author_81472655691"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "DEMO: OffPAD - Offline Personal Authenticating Device with Applications in Hospitals and e-Banking", "keywords": ["data authentication", "e-banking", "hospital authentication", "local user-centric identity management", "petname system", "phone cover", "secure hardware", "usable authentication"], "year": 2016, "abstract": "Identity and authentication solutions often lack usability and scalability, or do not provide high enough authentication assurance. The concept of Lucidman (Local User-Centric Identity Management) is an approach to providing scalable, secure and user friendly identity and authentication functionalities. In this context we demonstrate the use of an OffPAD (Offline"}, "ACM_article_3032086": {"authors": [{"name": "Magdalena Ivanovska", "id": "ACM_author_81470655309"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Francesco Sambo", "id": "ACM_author_81474695147"}], "title": "Bayesian deduction with subjective opinions", "keywords": [], "year": 2016, "abstract": "Bayesian deduction is the process of deriving the probability distribution of a random variable given the distribution of another variable when the relevant conditional distributions are available. We present an extension of Bayesian deduction to the framework of subjective logic. The latter represents uncertain probabilistic information in the form of"}, "ACM_article_2631779": {"authors": [{"name": "Ahmad Abdel-Hafez", "id": "ACM_author_87059405857"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "A rating aggregation method for generating product reputations", "keywords": ["ratings aggregation", "reputation model", "uncertainty"], "year": 2014, "abstract": "Many websites offer the opportunity for customers to rate items and then use customers' ratings to generate items reputation, which can be used later by other users for decision making purposes. The aggregated value of the ratings per item represents the reputation of this item. The accuracy of the reputation"}, "ACM_article_2585076": {"authors": [{"name": "Endang Djuana", "id": "ACM_author_81490693858"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}, {"name": "Yuefeng Li", "id": "ACM_author_81409597966"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "A Combined Method for Mitigating Sparsity Problem in Tag Recommendation", "keywords": ["Tag recommendation", "sparsity problem", "tags set expansion", "ontology", "folksonomy"], "year": 2014, "abstract": "Tag recommendation is a specific recommendation task for recommending metadata (tag) for a web resource (item) during user annotation process. In this context, sparsity problem refers to situation where tags need to be produced for items with few annotations or for user who tags few items. Most of the state"}, "ACM_article_3080307": {"authors": [{"name": "Audun JØsang", "id": "ACM_author_81100343007"}, {"name": "Guibing Guo", "id": "ACM_author_81508689214"}, {"name": "Maria Silvia Pini", "id": "ACM_author_81470641426"}, {"name": "Francesco Santini", "id": "ACM_author_81319500645"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}], "title": "Combining Recommender and Reputation Systems to Produce Better Online Advice", "keywords": [], "year": 2013, "abstract": "Although recommender systems and reputation systems have quite different theoretical and technical bases, both types of systems have the purpose of providing advice for decision making in e-commerce and online service environments. The similarity in purpose makes it natural to integrate both types of systems in order to produce better"}, "ACM_article_2530449": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Pierangela Samarati", "id": "ACM_author_81453623673"}, {"name": "Marinella Petrocchi", "id": "ACM_author_81100581941"}], "title": "Security and Trust Management: 8th International Workshop, STM 2012, Pisa, Italy, September 13-14, 2012, Revised Selected Papers", "keywords": [], "year": 2013, "abstract": "This book constitutes the thoroughly refereed post-conference proceedings of the 8th International Workshop on Security and Trust Management, STM 2012, held in Pisa, Italy, in September 2012 - in conjunction with the 17th European Symposium Research in Computer Security (ESORICS 2012). The 20 revised full papers were carefully reviewed and"}, "ACM_article_2399330": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Simon Pope", "id": "ACM_author_81100360518"}], "title": "Dempster's Rule As Seen By Little Colored Balls", "keywords": ["averaging operator", "belief theory", "cumulative operator", "fusion", "subjective logic"], "year": 2012, "abstract": "Dempster’s rule is traditionally interpreted as an operator for fusing belief functions. While there are different types of belief fusion, there has been considerable confusion regarding the exact type of operation that Dempster’s rule performs. Many alternative operators for belief fusion have been proposed, where some are based on the"}, "ACM_article_2376661": {"authors": [{"name": "Audun Josang", "id": "ACM_author_81100343007"}, {"name": "Kent A. Varmedal", "id": "ACM_author_81548030964"}, {"name": "Christophe Rosenberger", "id": "ACM_author_99658630812"}, {"name": "Rajendra Kumar", "id": "ACM_author_81548030966"}], "title": "Service provider authentication assurance", "keywords": ["Authentication,Servers,Humans,Browsers,Robustness,Usability"], "year": 2012, "abstract": "The concept of authentication assurance traditionally refers to the robustness of methods and mechanisms for user authentication, including the robustness of initial registration and provisioning of user credentials, as well as the robustness of mechanisms that enforce user authentication during operation. However, the user is not the only party that"}, "ACM_article_2159176": {"authors": [{"name": "Xujuan Zhou", "id": "ACM_author_81384607524"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}, {"name": "Yuefeng Li", "id": "ACM_author_81409597966"}, {"name": "Audun Josang", "id": "ACM_author_81100343007"}, {"name": "Clive Cox", "id": "ACM_author_81384608084"}], "title": "The state-of-the-art in personalized recommender systems for social networking", "keywords": ["Recommender systems", "Social networking", "Trust", "User profiles", "User generated content"], "year": 2012, "abstract": "With the explosion of Web 2.0 application such as blogs, social and professional networks, and various other types of social media, the rich online information and various new sources of knowledge flood users and hence pose a great challenge in terms of information overload. It is critical to use intelligent"}, "ACM_article_2120982": {"authors": [{"name": "Christian Muller-Schloer", "id": "ACM_author_81100616943"}, {"name": "Wolfgang Reif", "id": "ACM_author_81100564925"}, {"name": "Audun Josang", "id": "ACM_author_81100343007"}, {"name": "Jan-Philipp Steghofer", "id": "ACM_author_81438596999"}], "title": "Workshop Message", "keywords": [], "year": 2011, "abstract": "The second edition of the Workshop on Trustworthy Self-Organizing Systems explores topics of trust and self-organizat"}, "ACM_article_2052292": {"authors": [{"name": "Endang Djuana", "id": "ACM_author_81490693858"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}, {"name": "Yuefeng Li", "id": "ACM_author_81409597966"}, {"name": "Audun Josang", "id": "ACM_author_81100343007"}], "title": "Ontology Learning from User Tagging for Tag Recommendation Making", "keywords": ["collaborative tagging", "ontology learning", "tag recommendation"], "year": 2011, "abstract": "Recently, user tagging systems have grown in popularity on the web. The tagging process is quite simple for ordinary users, which contributes to its popularity. However, free vocabulary has lack of standardization and semantic ambiguity. It is possible to capture the semantics from user tagging into some form of ontology,"}, "ACM_article_2341590": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "Trust extortion on the internet", "keywords": [], "year": 2011, "abstract": "Dangers exist on the Internet in the sense that there are attackers who try to break into our computers or who in other ways try to trick us when we engage in online activities. In order to steer away from such dangers people tend to look for signals of security"}, "ACM_article_3088306": {"authors": [{"name": "Touhid Bhuiyan", "id": "ACM_author_81381592509"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}, {"name": "Audun JØsang", "id": "ACM_author_81100343007"}, {"name": "Huizhi Liang", "id": "ACM_author_81438593067"}, {"name": "Clive Cox", "id": "ACM_author_81384608084"}], "title": "Developing Trust Networks Based on User Tagging Information for Recommendation Making", "keywords": ["Interest Similarity", "Recommender Systems", "Social Networks and Tag", "Trust Networks"], "year": 2010, "abstract": "Recommender systems are one of the recent inventions to deal with ever growing information overload. Collaborative filtering seems to be the most popular technique in recommender systems. With sufficient background information of item ratings, its performance is promising enough. But research shows that it performs very poor in a cold"}, "ACM_article_1568666": {"authors": [{"name": "Joseph C. Jacob", "id": "ACM_author_81100437994"}, {"name": "Daniel S. Katz", "id": "ACM_author_81100411796"}, {"name": "G. Bruce Berriman", "id": "ACM_author_81100304111"}, {"name": "John C. Good", "id": "ACM_author_81342495926"}, {"name": "Anastasia C. Laity", "id": "ACM_author_81100358674"}, {"name": "Ewa Deelman", "id": "ACM_author_81100572004"}, {"name": "Carl Kesselman", "id": "ACM_author_81332508400"}, {"name": "Gurmeet Singh", "id": "ACM_author_81100278880"}, {"name": "Mei-Hui Su", "id": "ACM_author_81100108479"}, {"name": "Thomas A. Prince", "id": "ACM_author_81100003919"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "Montage: a grid portal and software toolkit for science-grade astronomical image mosaicking", "keywords": ["image mosaics", "astronomy", "software toolkit", "TeraGrid", "astronomical datasets", "grid computing", "grid portals", "virtual observatory"], "year": 2009, "abstract": "Montage is a portable software toolkit to construct custom, science-grade mosaics that preserve the astrometry and photometry of astronomical sources. The user specifies the dataset, wavelength, sky location, mosaic size, coordinate system, projection, and spatial sampling. Montage supports massive astronomical datasets that may be stored in distributed archives. Montage can"}, "ACM_article_1399177": {"authors": [{"name": "Ian Gorton", "id": "ACM_author_81100371712"}, {"name": "Paul Greenfield", "id": "ACM_author_81100515226"}, {"name": "Alex Szalay", "id": "ACM_author_81100055474"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "Data-Intensive Computing in the 21st Century", "keywords": ["compute-intensive problems", "data-intensive computing", "compute-intensive problems", "data-intensive computing"], "year": 2008, "abstract": "The deluge of data that future applications must process—in domains ranging from science to business informatics—creates a compelling argument for substantially increased R&D targeted at discovering scalable hardware and software solutions for data-intensive probl"}, "ACM_article_1171801": {"authors": [{"name": "S. G. Djorgovski", "id": "ACM_author_81100541354"}, {"name": "C. Donalek", "id": "ACM_author_81100539260"}, {"name": "A. Mahabal", "id": "ACM_author_81548308756"}, {"name": "R. Williams", "id": "ACM_author_81408594258"}, {"name": "A. J. Drake", "id": "ACM_author_81541515656"}, {"name": "M. J. Graham", "id": "ACM_author_81322494360"}, {"name": "E. Glikman", "id": "ACM_author_81322494405"}], "title": "Some Pattern Recognition Challenges in Data-Intensive Astronomy", "keywords": [], "year": 2006, "abstract": "We review some of the recent developments and challenges posed by the data analysis in modern digital sky surveys, which are representative of the information-rich astronomy in the context of Virtual Observatory. Illustrative examples include the problems of an automated star-galaxy classification in complex and heterogeneous panoramic imaging data sets,"}, "ACM_article_2737274": {"authors": [{"name": "Yanyan Yang", "id": "ACM_author_81100358646"}, {"name": "Omer F. Rana", "id": "ACM_author_81100158342"}, {"name": "David W. Walker", "id": "ACM_author_81332533837"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}, {"name": "Christos Georgousopoulos", "id": "ACM_author_81100026108"}, {"name": "Massimo Caffaro", "id": "ACM_author_99658678382"}, {"name": "Giovanni Aloisio", "id": "ACM_author_81100057335"}], "title": "An agent infrastructure for on-demand processing of remote-sensing archives", "keywords": ["Mobile agents", "Digital libraries", "Parallel and distributed computing", "Remote sensing", "XML"], "year": 2005, "abstract": "Advances in data collection techniques and database technologies, such as remote sensing and satellite telemetry, have led to the collection of huge amounts of data distributed among large databases and heterogeneous remote sites. Intelligent and automatic processing of the distributed data and efficiently supporting scientific collaboration between both professional and"}, "ACM_article_2154327": {"authors": [{"name": "Roy Williams", "id": "ACM_author_81408594258"}, {"name": "Conrad Steenberg", "id": "ACM_author_81100127126"}, {"name": "Julian Bunn", "id": "ACM_author_81100269374"}], "title": "HotGrid: graduated access to grid-based science gateways", "keywords": [], "year": 2005, "abstract": "We describe the idea of a Science Gateway, an application-specific task wrapped as a web service, and some examples of these that are being implemented on the US TeraGrid cyberinfrastructure. We also describe HotGrid, a means of providing simple, immediate access to the Grid through one of these gateways, which"}, "ACM_article_1007109": {"authors": [{"name": "Daniel S. Katz", "id": "ACM_author_81100411796"}, {"name": "Attila Bergou", "id": "ACM_author_81414618922"}, {"name": "G. Bruce Berriman", "id": "ACM_author_81100304111"}, {"name": "Gary L. Block", "id": "ACM_author_81414618406"}, {"name": "Jim Collier", "id": "ACM_author_81414599636"}, {"name": "David W. Curkendall", "id": "ACM_author_81430625856"}, {"name": "John Good", "id": "ACM_author_81342495926"}, {"name": "Laura Husman", "id": "ACM_author_81414620793"}, {"name": "Joseph C. Jacob", "id": "ACM_author_81100437994"}, {"name": "Anastasia Laity", "id": "ACM_author_81100358674"}, {"name": "P. Peggy Li", "id": "ACM_author_81100475438"}, {"name": "Craig Miller", "id": "ACM_author_81332515991"}, {"name": "Tom Prince", "id": "ACM_author_81100003919"}, {"name": "Herb Siegel", "id": "ACM_author_81414591788"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "Accessing and Visualizing Scientific Spatiotemporal Data", "keywords": [], "year": 2004, "abstract": "This paper discusses work done by JPL's ParallelApplications Technologies Group in helping scientistsaccess and visualize very large data sets through the useof multiple computing resources, such as parallelsupercomputers, clusters, and grids. These tools do oneor more of the following tasks: visualize local data setsfor local users, visualize local data sets"}, "ACM_article_823334": {"authors": [{"name": "Ewa Deelman", "id": "ACM_author_81100572004"}, {"name": "Carl Kesselman", "id": "ACM_author_81332508400"}, {"name": "Gaurang Mehta", "id": "ACM_author_81342504018"}, {"name": "Leila Meshkat", "id": "ACM_author_81100404217"}, {"name": "Laura Pearlman", "id": "ACM_author_81100465271"}, {"name": "Kent Blackburn", "id": "ACM_author_81100547267"}, {"name": "Phil Ehrens", "id": "ACM_author_81342493610"}, {"name": "Albert Lazzarini", "id": "ACM_author_81100133785"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}, {"name": "Scott Koranda", "id": "ACM_author_81342500862"}], "title": "GriPhyN and LIGO, Building a Virtual Data Grid for Gravitational Wave Scientists", "keywords": [], "year": 2002, "abstract": "Many Physics experiments today generate large volumes of data. That data is then processed in a variety of ways in order to achieve the understanding of fundamental physical phenomena. The goal of the NSF-funded GriPhyN project (Grid Physics Network) is to enable scientists to seamlessly access data whether it is"}, "ACM_article_605727": {"authors": [{"name": "Yanyan Yang", "id": "ACM_author_81100358646"}, {"name": "Omer F. Rana", "id": "ACM_author_81100158342"}, {"name": "David W. Walker", "id": "ACM_author_81332533837"}, {"name": "Christos Georgousopoulos", "id": "ACM_author_81100026108"}, {"name": "Giovanni Aloisio", "id": "ACM_author_81100057335"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "Agent based data management in digital libraries", "keywords": ["data fusion", "data migration and management", "mobile and intelligent agents", "parallel data analysis"], "year": 2002, "abstract": "Digital libraries (DLs) generally contain a collection of independently maintained data sets, in different formats, which may be queried by geographically dispersed users. A DL should enable new data sources to be dynamically added, and allow changes in content and in the schema of sources which are already part of"}, "ACM_article_779287": {"authors": [{"name": "Omer F. Rana", "id": "ACM_author_81100158342"}, {"name": "Yanyan Yang", "id": "ACM_author_81100358646"}, {"name": "Christos Georgousopoulos", "id": "ACM_author_81100026108"}, {"name": "David W. Walker", "id": "ACM_author_81332533837"}, {"name": "Giovanni Aloisio", "id": "ACM_author_81100057335"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "Towards an XML and agent-based framework for the distributed management and analysis of multi-spectral data", "keywords": [], "year": 2002, "abstract": "Implementation and use of a prototype distributed active data archive system are outlined. This system is based on the Synthetic Aperture Radar Atlas (SARA) and utilises cooperative software agents for data access and analysis, and uses XML to model metadata and support agent communication. The analysis is undertaken on a"}, "ACM_article_615898": {"authors": [{"name": "Giovanni Aloisio", "id": "ACM_author_81100057335"}, {"name": "Massimo Cafaro", "id": "ACM_author_81100121882"}, {"name": "Carl Kesselman", "id": "ACM_author_81332508400"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "Web Access to Supercomputing", "keywords": [], "year": 2001, "abstract": "Theoretically, computational and data grids are the computing paradigm of choice, but they will not gain wide acceptance until users have seamless access to them. The authors describe how to provide comfortable, intuitive, yet powerful Web access to supercomputing. A Web-based, grid-enabled application that processes, analyzes, and delivers remote-sensing images"}, "ACM_article_668708": {"authors": [{"name": "Ewa Deelman", "id": "ACM_author_81100572004"}, {"name": "Carl Kesselman", "id": "ACM_author_81332508400"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}, {"name": "Kent Blackburn", "id": "ACM_author_81100547267"}, {"name": "Albert Lazzarini", "id": "ACM_author_81100133785"}, {"name": "Scott Koranda", "id": "ACM_author_81342500862"}], "title": "Applications of Virtual Data in the LIGO Experiment", "keywords": [], "year": 2001, "abstract": "Many Physics experiments today generate large volumes of data. That data is then processed in many ways in order to achieve the understanding of fundamental physical phenomena. Virtual Data is a concept that unifies the view of the data whether it is raw or derived. It provides a new degree"}, "ACM_article_658923": {"authors": [{"name": "Ewa Deelman", "id": "ACM_author_81100572004"}, {"name": "Carl Kesselman", "id": "ACM_author_81332508400"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}, {"name": "Albert Lazzarini", "id": "ACM_author_81100133785"}, {"name": "Thomas A. Prince", "id": "ACM_author_81100003919"}, {"name": "Joe Romano", "id": "ACM_author_81342509410"}, {"name": "Bruce Allen", "id": "ACM_author_81545796556"}], "title": "A Virtual Data Grid for LIGO", "keywords": [], "year": 2001, "abstract": "GriPhyN (Grid Physics Network) is a large US collaboration to build grid services for large physics experiments, one of which is LIGO, a gravitational-wave observatory. This paper explains the physics and computing challenges of LIGO, and the tools that GriPhyN will build to address them. A key component needed to"}, "ACM_article_356438": {"authors": [{"name": "J. Häuser", "id": "ACM_author_81430664902"}, {"name": "T. Ludewig", "id": "ACM_author_81430654897"}, {"name": "R. D. Williams", "id": "ACM_author_81408594258"}, {"name": "R. Winkelmann", "id": "ACM_author_81430673088"}, {"name": "T. Gollnick", "id": "ACM_author_81430606134"}, {"name": "S. Brunett", "id": "ACM_author_81100565958"}, {"name": "J. Muylaert", "id": "ACM_author_81430649540"}], "title": "A test suite for high-performance parallel Java", "keywords": ["Java", "Navier-Stokes", "parallel programs"], "year": 2000, "abstract": ""}, "ACM_article_786000": {"authors": [{"name": "Yanyan Yang", "id": "ACM_author_81100358646"}, {"name": "Omer F. Rana", "id": "ACM_author_81100158342"}, {"name": "Christos Georgousopoulos", "id": "ACM_author_81100026108"}, {"name": "David W. Walker", "id": "ACM_author_81332533837"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "Mobile Agents and the SARA Digital Library", "keywords": ["Digital Libraries", "Mobile Agents", "Parallel and Distributed Computing", "Multi-Agent Systems", "Remote Sensing"], "year": 2000, "abstract": "Remote-sensing data about the Earth's environment is being created at an ever-increasing rate and distributed among heterogeneous remote sites. Traditional models of distributed computing are inadequate to support such complex applications, which generally involve a large quantity of data. In this paper, we explore an approach based on mobile agent"}, "ACM_article_658444": {"authors": [{"name": "Giovanni Aloisio", "id": "ACM_author_81100057335"}, {"name": "Massimo Cafaro", "id": "ACM_author_81100121882"}, {"name": "Paolo Falabella", "id": "ACM_author_81100651279"}, {"name": "Carl Kesselman", "id": "ACM_author_81332508400"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "Grid Computing on the Web Using the Globus Toolkit", "keywords": [], "year": 2000, "abstract": "In this paper we present and discuss an architecture that allows transparent access to remote supercomputing facilities from a web gateway. The implementation exploits the Globus toolkit and provides users with fast, secure and reliable access to parallel applications. We show the usefulness of our approach in the context of"}, "ACM_article_335685": {"authors": [{"name": "Roy Williams", "id": "ACM_author_81408594258"}, {"name": "Julian Bunn", "id": "ACM_author_81100269374"}, {"name": "Reagan Moore", "id": "ACM_author_81430626651"}, {"name": "James C.T. Pool", "id": "ACM_author_81100208617"}], "title": "Findings, questions and recommendations from the ISDA workshop", "keywords": [], "year": 1999, "abstract": ""}, "ACM_article_335694": {"authors": [{"name": "G. Aloisio", "id": "ACM_author_81100057335"}, {"name": "G. Milillo", "id": "ACM_author_81430601877"}, {"name": "R. D. Williams", "id": "ACM_author_81408594258"}], "title": "An XML architecture for high-performance web-based analysis of remote-sensing archives", "keywords": [], "year": 1999, "abstract": ""}, "ACM_article_660632": {"authors": [{"name": "Kent Blackburn", "id": "ACM_author_81100547267"}, {"name": "Albert Lazzarini", "id": "ACM_author_81100133785"}, {"name": "Thomas A. Prince", "id": "ACM_author_81100003919"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "XSIL: Extensible Scientific Interchange Language", "keywords": [], "year": 1999, "abstract": ""}, "ACM_article_660335": {"authors": [{"name": "Giovanni Aloisio", "id": "ACM_author_81100057335"}, {"name": "Massimo Cafaro", "id": "ACM_author_81100121882"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "The Digital Puglia Project: An Active Digital Library of Remote Sensing Data", "keywords": [], "year": 1999, "abstract": ""}, "ACM_article_309015": {"authors": [{"name": "Roy Williams", "id": "ACM_author_81408594258"}, {"name": "Bruce Sears", "id": "ACM_author_81414600606"}], "title": "A high-performance active digital library", "keywords": ["Java", "MPI", "user interface", "digital library", "data computing", "parallel computing"], "year": 1998, "abstract": ""}, "ACM_article_310204": {"authors": [{"name": "Wolfgang E. Nagel", "id": "ACM_author_81100214826"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "Metacomputing: from ideas to real implementation", "keywords": [], "year": 1998, "abstract": ""}, "ACM_article_659692": {"authors": [{"name": "Roy Williams", "id": "ACM_author_81408594258"}, {"name": "Bruce Sears", "id": "ACM_author_81414600606"}], "title": "PARAFLOW: A Dataflow Distributed Data-Computing System", "keywords": [], "year": 1998, "abstract": ""}, "ACM_article_659048": {"authors": [{"name": "Giovanni Aloisio", "id": "ACM_author_81100057335"}, {"name": "Massimo Cafaro", "id": "ACM_author_81100121882"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}, {"name": "Paul Messina", "id": "ACM_author_81100598994"}], "title": "A Distributed Web-Based Metacomputing Environment", "keywords": [], "year": 1997, "abstract": ""}, "ACM_article_224281": {"authors": [{"name": "Craig Miller", "id": "ACM_author_81332515991"}, {"name": "David G. Payne", "id": "ACM_author_81100557790"}, {"name": "Thanh N. Phung", "id": "ACM_author_81542957856"}, {"name": "Herb Siegel", "id": "ACM_author_81414591788"}, {"name": "Roy Williams", "id": "ACM_author_81408594258"}], "title": "Parallel processing of spaceborne imaging radar data", "keywords": ["synthetic aperture radar", "image processing", "parallel processing"], "year": 1995, "abstract": "We discuss the results of a collaborative project on parallel processing of Synthetic Aperture Radar (SAR) data, carried out between the NASA/Jet Propulsion Laboratory (JPL), the California Institute of Technology (Caltech) and Intel Scalable Systems Division (SSD). Through this collaborative effort, we have successfully parallelized the most compute-intensive SAR correlator"}, "ACM_article_146631": {"authors": [{"name": "Roy D. Williams", "id": "ACM_author_81408594258"}], "title": "Voxel databases: a paradigm for parallelism with spatial structure", "keywords": [], "year": 1992, "abstract": ""}, "ACM_article_124739": {"authors": [{"name": "Roy D. Williams", "id": "ACM_author_81408594258"}], "title": "Performance of dynamic load balancing algorithms for unstructured mesh calculations", "keywords": [], "year": 1991, "abstract": ""}, "ACM_article_92006": {"authors": [{"name": "P. Messina", "id": "ACM_author_81100598994"}, {"name": "C. Baillie", "id": "ACM_author_81100474855"}, {"name": "E. Felten", "id": "ACM_author_81100373504"}, {"name": "P. Hipes", "id": "ACM_author_81332504343"}, {"name": "R. Williams", "id": "ACM_author_81408594258"}, {"name": "A. Alagar", "id": "ACM_author_81100105817"}, {"name": "A. Kamrath", "id": "ACM_author_81100120381"}, {"name": "R. Leary", "id": "ACM_author_81326490679"}, {"name": "W. Pfeiffer", "id": "ACM_author_81326492137"}, {"name": "J. Rogers", "id": "ACM_author_81100174424"}, {"name": "D. Walker", "id": "ACM_author_81332533837"}], "title": "Benchmarking advanced architecture computers", "keywords": [], "year": 1990, "abstract": ""}, "ACM_article_63136": {"authors": [{"name": "R. D. Williams", "id": "ACM_author_81408594258"}], "title": "DIME: a programming environment for unstructured triangular meshes on a distributed-memory parallel processor", "keywords": [], "year": 1989, "abstract": "DIME (Distributed Irregular Mesh Environment) is a user environment written in C for manipulation of an unstructured triangular mesh in two dimensions. The mesh is distributed among the separate memories of the processors, and communication between processors is handled by DIME; thus the user writes C-code referring to the elements"}, "ACM_article_62401": {"authors": [{"name": "J. Flower", "id": "ACM_author_81332499071"}, {"name": "R. Williams", "id": "ACM_author_81408594258"}], "title": "Parallel programming in comfort", "keywords": [], "year": 1988, "abstract": "We describe a set of software utilities designed to facilitate the writing of parallel codes and porting sequential ones. Emphasis is placed on portability so that code can be developed simultaneously on a sequential and a parallel machine, and so that the completed code can be run and maintained on"}, "ACM_article_2672803": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}, {"name": "Dong Li", "id": "ACM_author_81461646385"}], "title": "LastingNVCache: A Technique for Improving the Lifetime of Non-volatile Caches", "keywords": ["Non-volatile memory (NVM)", "microarchitectural technique", "device lifetime", "write-endurance", "wear-leveling", "intra-set write variation"], "year": 2014, "abstract": "Use of non-volatile memory (NVM) devices such as resistive RAM (ReRAM) and spin transfer torque RAM (STT-RAM) for designing on-chip caches holds the promise of providing a high-density, low-leakage alternative to SRAM. However, low write endurance of NVMs, along with the write-variation introduced by existing cache management schemes significantly limits"}, "ACM_article_2600216": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}, {"name": "Dong Li", "id": "ACM_author_81461646385"}], "title": "Improving energy efficiency of embedded DRAM caches for high-end computing systems", "keywords": ["leakage energy saving", "cache reconfiguration", "embedded dram (edram) cache", "low-power", "refresh energy saving"], "year": 2014, "abstract": "The number of cores in a single chip in the nodes of high-end computing systems is on rise, due, in part, to a number of constraints, such as power consumption. With this, the size of the last level cache (LLC) has also increased significantly. Since LLCs built with SRAM consume"}, "ACM_article_2635740": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A study of successive over-relaxation method parallelisation over modern HPC languages", "keywords": [], "year": 2014, "abstract": "Successive over-relaxation SOR is a computationally intensive, yet extremely important iterative solver for solving linear systems. Due to recent trends of exponential growth in the amount of data generated and increasing problem sizes, serial platforms have proved to be insufficient in providing the required computational power. In this paper, we"}, "ACM_article_2591525": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Jeffrey S. Vetter", "id": "ACM_author_81100367555"}, {"name": "Dong Li", "id": "ACM_author_81461646385"}], "title": "WriteSmoothing: improving lifetime of non-volatile caches using intra-set wear-leveling", "keywords": ["cache memory", "device lifetime", "intra-set write variation", "non-volatile memory", "wear-leveling", "write endurance"], "year": 2014, "abstract": "Driven by the trends of increasing core-count and bandwidth-wall problem, the size of last level caches (LLCs) has greatly increased. Since SRAM consumes high leakage power, researchers have explored use of non-volatile memories (NVMs) for designing caches as they provide high density and consume low leakage power. However, since NVMs"}, "ACM_article_2478471": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Zhao Zhang", "id": "ACM_author_81100116187"}, {"name": "Yanan Cao", "id": "ACM_author_84758643957"}], "title": "CASHIER: A Cache Energy Saving Technique for QoS Systems", "keywords": ["QoS systems", "cache leakage energy saving", "low power", "online profiling", "last level cache"], "year": 2013, "abstract": "With each CMOS technology generation, leakage energy has been increasing at an exponential rate and hence, managing the energy consumption of large, last-level caches is becoming a critical research issue in modern chip design. Saving cache energy in QoS systems is especially challenging, since, to avoid missing deadlines, a suitable"}, "ACM_article_2421513": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}], "title": "A survey of architectural techniques for DRAM power management", "keywords": [], "year": 2012, "abstract": "Recent trends of CMOS technology scaling and wide-spread use of multicore processors have dramatically increased the power consumption of main memory. It has been estimated that modern data-centres spend more than 30&#37; of their total power consumption in main memory alone. This excessive power dissipation has created the problem of"}, "ACM_article_1960384": {"authors": [{"name": "Sparsh Mittal", "id": "ACM_author_81482652396"}, {"name": "Ankush Mittal", "id": "ACM_author_99658996558"}], "title": "Versatile question answering systems: seeing in synthesis", "keywords": [], "year": 2011, "abstract": "Recent advances in massive information storage and growth of internet have led to increased necessity of tools such as search engines and QA systems to get meaningful answers from the vast amount of information. The complex questions appearing in real-life generally require multiple techniques or sub-division of question at various"}, "ACM_article_1991376": {"authors": [{"name": "Touhid Bhuiyan", "id": "ACM_author_81381592509"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Huizhi Liang", "id": "ACM_author_81438593067"}, {"name": "Clive Cox", "id": "ACM_author_81384608084"}], "title": "Developing trust networks based on user tagging information for recommendation making", "keywords": ["interest similarity", "social networks and tag", "recommender systems", "trust networks"], "year": 2010, "abstract": "Recommender systems are one of the recent inventions to deal with ever growing information overload. Collaborative filtering seems to be the most popular technique in recommender systems. With sufficient background information of item ratings, its performance is promising enough. But research shows that it performs very poor in a cold"}, "ACM_article_1933210": {"authors": [{"name": "Touhid Bhuiyan", "id": "ACM_author_81381592509"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}, {"name": "Audun Josang", "id": "ACM_author_81100343007"}], "title": "SimTrust: A New Method of Trust Network Generation", "keywords": ["trust network", "interest similarity", "recommender", "rating", "tag"], "year": 2010, "abstract": "Trust can be used for neighbor formation to generate automated recommendations. User assigned explicit rating data can be used for this purpose. However, the explicit rating data is not always available. In this paper we present a new method of generating trust network based on user’s interest similarity. To identify"}, "ACM_article_1962614": {"authors": [{"name": "Audun Josang", "id": "ACM_author_81100343007"}], "title": "Robustness of Trust and Reputation Systems", "keywords": [], "year": 2010, "abstract": "The purpose of trust and reputation systems is to strengthen the quality of markets and communities by providing an incentive for good behaviour and quality services, and by sanctioning bad behaviour and low quality services. However, trust and reputation systems will only be able to produce this effect when they"}, "ACM_article_1915125": {"authors": [{"name": "Mohammed Alzomai", "id": "ACM_author_81361608866"}, {"name": "Audun Josang", "id": "ACM_author_81100343007"}], "title": "The Mobile Phone as a Multi OTP Device Using Trusted Computing", "keywords": ["Authentication", "OTP", "trusted computing", "mobile phone", "OTP tokens", "identity management", "usability"], "year": 2010, "abstract": "The rapid growth in the number of online services leads to an increasing number of different digital identities each user needs to manage. As a result, many people feel overloaded with credentials, which in turn negatively impacts their abilityto manage them securely. Passwords are perhaps the most common type of"}, "ACM_article_1894904": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Lothar Fritsch", "id": "ACM_author_81343492824"}, {"name": "Tobias Mahler", "id": "ACM_author_81384603209"}], "title": "Privacy policy referencing", "keywords": [], "year": 2010, "abstract": "Data protection legislation was originally defined for a context where personal information is mostly stored on centralized servers with limited connectivity and openness to 3rd party access. Currently, servers are connected to the Internet, where a large amount of personal information is continuously being exchanged as part of application transactions."}, "ACM_article_1857234": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Glenn Bewsell", "id": "ACM_author_81467670329"}], "title": "Guest editors' introduction", "keywords": [], "year": 2010, "abstract": ""}, "ACM_article_1875442": {"authors": [{"name": "Masakatsu Nishigaki", "id": "ACM_author_81472647099"}, {"name": "Audun Josang", "id": "ACM_author_81100343007"}, {"name": "Yuko Murayama", "id": "ACM_author_81100434502"}, {"name": "Stephen Marsh", "id": "ACM_author_81100322780"}], "title": "Trust Management IV: 4th IFIP WG 11.11 International Conference, IFIPTM 2010, Morioka, Japan, June 16-18, 2010, Proceedings", "keywords": [], "year": 2010, "abstract": "This book constitutes the refereed proceedings of the 4th IFIP WG 11.11 International Conference, IFIPTM 2010, held in Morioka, Japan, in June 2010. The 18 revised full papers presented together with 2 invited papers were carefully reviewed and selected from 61 submissions. The papers are organized in topical sections on"}, "ACM_article_1710304": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Javier Diaz", "id": "ACM_author_81384592888"}, {"name": "Maria Rifqi", "id": "ACM_author_81100150589"}], "title": "Cumulative and averaging fusion of beliefs", "keywords": ["Belief theory", "Fusion", "Dempster's rule", "Subjective logic"], "year": 2010, "abstract": "The problem of fusing beliefs in the Dempster-Shafer belief theory has attracted considerable attention over the last two decades. The classical Dempster's rule has often been criticised, and many alternative rules for belief fusion have been proposed in the literature. We show that it is crucial to consider the nature"}, "ACM_article_3089849": {"authors": [{"name": "Md. Sadek Ferdous", "id": "ACM_author_81443596543"}, {"name": "Audun JØsang", "id": "ACM_author_81100343007"}, {"name": "Kuldeep Singh", "id": "ACM_author_81453650510"}, {"name": "Ravishankar Borgaonkar", "id": "ACM_author_81443596653"}], "title": "Security Usability of Petname Systems", "keywords": [], "year": 2009, "abstract": "To have certainty about identities is crucial for secure communication in digital environments. The number of digital identities that people and organizations need to manage is rapidly increasing, and proper management of these identities is essential for maintaining security in online markets and communities. Traditional Identity Management Systems are designed"}, "ACM_article_1616764": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Walter Quattrociocchi", "id": "ACM_author_81413605183"}], "title": "Advanced Features in Bayesian Reputation Systems", "keywords": [], "year": 2009, "abstract": "Bayesian reputation systems are quite flexible and can relatively easily be adapted to different types of applications and environments. The purpose of this paper is to provide a concise overview of the rich set of features that characterizes Bayesian reputation systems. In particular we demonstrate the importance of base rates"}, "ACM_article_1807528": {"authors": [{"name": "Bandar Alhaqbani", "id": "ACM_author_81461659351"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Colin Fidge", "id": "ACM_author_81100449605"}], "title": "A medical data reliability assessment model", "keywords": ["subjective logic", "reputation", "trustworthiness", "electronic health records", "reliability"], "year": 2009, "abstract": "There is currently a strong focus worldwide on the potential of large-scale Electronic Health Record (EHR) systems to cut costs and improve patient outcomes through increased efficiency. This is accomplished by aggregating medical data from isolated Electronic Medical Record databases maintained by different healthcare providers. Concerns about the privacy and"}, "ACM_article_1638367": {"authors": [{"name": "Touhid Bhuiyan", "id": "ACM_author_81381592509"}, {"name": "Audun Josang", "id": "ACM_author_81100343007"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}], "title": "An Analysis of Trust Transitivity Taking Base Rate into Account", "keywords": ["Trust", "Subjective logic", "Transitivity", "Propagation"], "year": 2009, "abstract": "Trust transitivity, as trust itself, is a human mental phenomenon, so there is no such thing as objective transitivity, and trust transitivity therefore lends itself to different interpretations. Trust transitivity and trust fusion both are important elements in computational trust. This paper analyses the parameter dependence problem in trust transitivity"}, "ACM_article_1503353": {"authors": [{"name": "Suriadi Suriadi", "id": "ACM_author_81333491500"}, {"name": "Ernest Foo", "id": "ACM_author_81100571152"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "A user-centric federated single sign-on system", "keywords": ["Single sign-on", "User-centric", "Identity management", "Privacy", "Private credential"], "year": 2009, "abstract": "Current identity management systems are not concerned with user privacy. Users must assume that identity providers and service providers will ensure their privacy, which is not always the case. This paper proposes an extension of the existing federated single sign-on (FSSO) systems that adopts the beneficial properties of the user-centric"}, "ACM_article_1494109": {"authors": [{"name": "Mohammed Aizomai", "id": "ACM_author_81392618491"}, {"name": "Audun Josang", "id": "ACM_author_81100343007"}, {"name": "Adrian McCullagh", "id": "ACM_author_81361608348"}, {"name": "Ernest Foo", "id": "ACM_author_81100571152"}], "title": "Strengthening SMS-Based Authentication through Usability", "keywords": ["Security", "usability", "identity management", "authentication", "authorization", "online banking"], "year": 2008, "abstract": "Current state-of-the art solutions for online banking authentication and identity management include methods for re-authenticating users via out-of-band channels for each transaction. SMS-based schemes belong to this category, and can provide strong authentication to protect against security attacks. Poor usability of these schemes is still a problem, which makes them"}, "ACM_article_1487271": {"authors": [{"name": "Touhid Bhuiyan", "id": "ACM_author_81381592509"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "Integrating Trust with Public Reputation in Location-Based Social Networks for Recommendation Making", "keywords": ["Trust", "Reputation management", "Recommendation", "Location-based social network"], "year": 2008, "abstract": "The recent emergence of location-based social networking services is revolutionizing web-based social networking allowing users to share real-life experiences via geo-tagged user-generated multimedia content. One of the key challenges of the web-based social networks as an information sharing and exchanging channel is how to manage healthy relationships among community users"}, "ACM_article_1430680": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Touhid Bhuiyan", "id": "ACM_author_81381592509"}, {"name": "Yue Xu", "id": "ACM_author_81314493213"}, {"name": "Clive Cox", "id": "ACM_author_81384608084"}], "title": "Combining Trust and Reputation Management for Web-Based Services", "keywords": [], "year": 2008, "abstract": "Services offered and provided through the Web have varying quality, and it is often difficult to assess the quality of a services before accessing and using it. Trust and reputation systems can be used in order to assist users in predicting and selecting the best quality services. This paper describes"}, "ACM_article_1447915": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Touhid Bhuiyan", "id": "ACM_author_81381592509"}], "title": "Optimal Trust Network Analysis with Subjective Logic", "keywords": ["trust", "subjective logic", "TNA-SL", "trust network", "reputation systems"], "year": 2008, "abstract": "Trust network analysis with subjective logic (TNA-SL) simplifies complex trust graphs into series-parallel graphs by removing the most uncertain paths to obtain a canonical graph. This simplification could in theory cause loss of information and thereby lead to sub-optimal results. This paper describes a new method for trust network analysis"}, "ACM_article_1385123": {"authors": [{"name": "Mohammed AlZomai", "id": "ACM_author_81361608866"}, {"name": "Bander AlFayyadh", "id": "ACM_author_81361609082"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Adrian McCullagh", "id": "ACM_author_81361608348"}], "title": "An exprimental investigation of the usability of transaction authorization in online bank security systems", "keywords": ["authentication", "security", "usability", "authorization", "identity management", "online banking"], "year": 2008, "abstract": "Security for online banking has changed considerably during the relatively short period that online banking has been in use. In particular, authentication and identity management in the early implementations were, and sometimes still are, vulnerable to various attacks such as phishing. Current state-of-the art solutions include methods for re-authenticating users"}, "ACM_article_1385120": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Bander AlFayyadh", "id": "ACM_author_81361609082"}], "title": "Robust WYSIWYS: a method for ensuring that what you see is what you sign", "keywords": [], "year": 2008, "abstract": "The security of digital signatures depends not only on the cryptographic strength of the digital signature algorithms used, but also on the integrity of the platform on which the digital signature application is running. Breach of platform integrity due to unintentional or intentional malfunctioning has the potential of wrongly imposing"}, "ACM_article_1462247": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Zied Elouedi", "id": "ACM_author_81100339057"}], "title": "Interpreting Belief Functions as Dirichlet Distributions", "keywords": [], "year": 2007, "abstract": "Traditional Dempster Shafer belief theory does not provide a simple method for judging the effect of statistical and probabilistic data on belief functions and vice versa. This puts belief theory in isolation from probability theory and hinders fertile cross-disciplinary developments, both from a theoretic and an application point of view."}, "ACM_article_1307020": {"authors": [{"name": "Suriadi Suriadi", "id": "ACM_author_81333491500"}, {"name": "Ernest Foo", "id": "ACM_author_81100571152"}, {"name": "Audun Josang", "id": "ACM_author_81100343007"}], "title": "A User-centric Federated Single Sign-on System", "keywords": [], "year": 2007, "abstract": "There is a lack of built-in privacy mechanisms within the current identity management systems. The guarantee a user has about their privacy is merely the \"trust' that the service providers will enforce their privacy requirements. The contribution of this paper is a proposal for the extension of existing Federated Single"}, "ACM_article_1250463": {"authors": [{"name": "Audun Josang", "id": "ACM_author_81100343007"}, {"name": "Jochen Haller", "id": "ACM_author_81330492103"}], "title": "Dirichlet Reputation Systems", "keywords": [], "year": 2007, "abstract": "Reputation systems can be used in online markets and communities in order to stimulate quality and good behaviour as well as to sanction poor quality and bad behaviour. The basic idea is to have a mechanism for rating services on various aspects, and a way of computing reputation scores based"}, "ACM_article_1225716": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Roslan Ismail", "id": "ACM_author_99659382769"}, {"name": "Colin Boyd", "id": "ACM_author_81100112037"}], "title": "A survey of trust and reputation systems for online service provision", "keywords": ["Reputation", "Security", "Transitivity", "Trust", "Collaboration", "E-commerce", "Decision"], "year": 2007, "abstract": "Trust and reputation systems represent a significant trend in decision support for Internet mediated service provision. The basic idea is to let parties rate each other, for example after the completion of a transaction, and use the aggregated ratings about a given party to derive a trust or reputation score,"}, "ACM_article_1274548": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Muhammed Al Zomai", "id": "ACM_author_81333492015"}, {"name": "Suriadi Suriadi", "id": "ACM_author_81333491500"}], "title": "Usability and privacy in identity management architectures", "keywords": ["federation", "identity management", "privacy", "security", "usability", "user-centric"], "year": 2007, "abstract": "Digital identities represent who we are when engaging in online activities and transactions. The rapid growth in the number of online services leads to in an increasing number of different identities that each user needs to manage. As a result, many people feel overloaded with identities and suffer from password"}, "ACM_article_1273707": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "Probabilistic logic under uncertainty", "keywords": ["belief theory", "beta", "dirichlet", "opinion", "probabilistic logic", "subjective logic", "uncertainty"], "year": 2007, "abstract": "Probabilistic logic combines the capability of binary logic to express the structure of argument models with the capacity of probabilities to express degrees of truth of those arguments. The limitation of traditional probabilistic logic is that it is unable to express uncertainty about the probability values themselves. This paper provides"}, "ACM_article_1793923": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "Trust and reputation systems", "keywords": [], "year": 2007, "abstract": "There are currently very few practical methods for assessing the quality of resources or the reliability of other entities in the online environment. This makes it difficult to make decisions about which resources can be relied upon and which entities it is safe to interact with. Trust and reputation systems"}, "ACM_article_2095024": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Stephen Marsh", "id": "ACM_author_81100322780"}, {"name": "Simon Pope", "id": "ACM_author_81100360518"}], "title": "Exploring different types of trust propagation", "keywords": [], "year": 2006, "abstract": "Trust propagation is the principle by which new trust relationships can be derived from pre-existing trust relationship. Trust transitivity is the most explicit form of trust propagation, meaning for example that if Alice trusts Bob, and Bob trusts Claire, then by transitivity, Alice will also trust Claire. This assumes that"}, "ACM_article_1239778": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Elizabeth Gray", "id": "ACM_author_81328488597"}, {"name": "Michael Kinateder", "id": "ACM_author_81328488924"}], "title": "Simplification and analysis of transitive trust networks", "keywords": ["Networks", "Pagerank", "Reputation", "Transitivity", "Trust", "Subjective Logic", "Tna-Sl", "Belief", "Dspg", "Eigentrust", "P2p"], "year": 2006, "abstract": "When transacting and interacting through open computer networks, traditional methods used in the physical world for establishing trust can no longer be used. Creating virtual network substitutes with which people, organisations and software agents can derive trust in other parties requires computerised analysis of the underlying trust networks. This article"}, "ACM_article_1151848": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Dieter Gollmann", "id": "ACM_author_81100392220"}, {"name": "Richard Au", "id": "ACM_author_81100100511"}], "title": "A method for access authorisation through delegation networks", "keywords": [], "year": 2006, "abstract": "Owners of systems and resources usually want to control who can access them. This must be based on having a process for authorising certain parties, combined with mechanisms for enforcing that only authorised parties are actually able to access those systems and resources. In distributed systems, the authorisation process can"}, "ACM_article_1151710": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Ross Hayward", "id": "ACM_author_81332503350"}, {"name": "Simon Pope", "id": "ACM_author_81100360518"}], "title": "Trust network analysis with subjective logic", "keywords": [], "year": 2006, "abstract": "Trust networks consist of transitive trust relationships between people, organisations and software agents connected through a medium for communication and interaction. By formalising trust relationships, e.g. as reputation scores or as subjective trust measures, trust between parties within the community can be derived by analysing the trust paths linking the"}, "ACM_article_2138295": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Simon Pope", "id": "ACM_author_81100360518"}, {"name": "Milan Daniel", "id": "ACM_author_81100448514"}], "title": "Conditional deduction under uncertainty", "keywords": [], "year": 2005, "abstract": "Conditional deduction in binary logic basically consists of deriving new statements from an existing set of statements and conditional rules. Modus Ponens, which is the classical example of a conditional deduction rule, expresses a conditional relationship between an antecedent and a consequent. A generalisation of Modus Ponens to probabilities in"}, "ACM_article_2154462": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Claudia Keser", "id": "ACM_author_81100172718"}, {"name": "Theo Dimitrakos", "id": "ACM_author_81100323888"}], "title": "Can we manage trust?", "keywords": [], "year": 2005, "abstract": "The term trust management suggests that trust can be managed, for example by creating trust, by assessing trustworthiness, or by determining optimal decisions based on specific levels of trust. The problem to date is that trust management in online environments is a diverse and ill defined discipline. In fact, the"}, "ACM_article_1082305": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "John Fabre", "id": "ACM_author_81100523063"}, {"name": "Brian Hay", "id": "ACM_author_81350597050"}, {"name": "James Dalziel", "id": "ACM_author_81100458236"}, {"name": "Simon Pope", "id": "ACM_author_81100360518"}], "title": "Trust requirements in identity management", "keywords": [], "year": 2005, "abstract": "Identity management refers to the process of representing and recognising entities as digital identities in computer networks. Authentication, which is an integral part of identity management, serves to verify claims about holding specific identities. Identity management is therefore fundamental to, and sometimes include, other security constructs such as authorisation and"}, "ACM_article_1082284": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Simon Pope", "id": "ACM_author_81100360518"}], "title": "Semantic constraints for trust transitivity", "keywords": [], "year": 2005, "abstract": "To describe the concept of transitive trust in a simplified way, assume that agent A trusts agent B, and that agent B trusts agent C, then by transitivity, agent A trusts agent C. Trust transitivity manifests itself in various forms during real life human interaction, but can be challenging to"}, "ACM_article_1082167": {"authors": [{"name": "Ryan Wishart", "id": "ACM_author_81100272352"}, {"name": "Ricky Robinson", "id": "ACM_author_81100187671"}, {"name": "Jadwiga Indulska", "id": "ACM_author_81100586909"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "SuperstringRep: reputation-enhanced service discovery", "keywords": [], "year": 2005, "abstract": "Service discovery protocols are used in distributed systems to locate services for clients. The services that are located as well as the clients requesting service are commonly assumed to be trustworthy and reliable. This assumption can lead to security problems, particularly when clients and services are transient, as is the"}, "ACM_article_976445": {"authors": [{"name": "Daniel Bradley", "id": "ACM_author_81100174958"}, {"name": "Audun Josang", "id": "ACM_author_81100343007"}], "title": "Mesmerize: an open framework for enterprise security management", "keywords": ["policy", "network security", "enterprise security management", "expert system"], "year": 2004, "abstract": "We have identified five problems that inhibit effective enterprise security management - policy divide, lack of reproducibility, lack of consistency, lack of coverage and lack of flexibility in current management systems. We discuss these problems and suggest features an enterprise security management framework should have to address them.Mesmerize is an"}, "ACM_article_960843": {"authors": [{"name": "Mary Anne Patton", "id": "ACM_author_81100406382"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "Technologies for Trust in Electronic Commerce", "keywords": ["alternative dispute resolution mechanisms", "cryptography", "digital certificates", "e-commerce", "embodied conversational agents", "mathematical trust models", "payment intermediaries", "privacy", "reputation systems", "security", "trust", "trustmark seals"], "year": 2004, "abstract": "Lack of consumer trust in e-commerce merchants, e-commerce technology, and the social, financial and legal infrastructures of the e-commerce environment, poses a major challenge to the large-scale uptake of business to consumer e-commerce. Most traditional cues for assessing trust in the physical world are not available online. This paper gives"}, "ACM_article_976448": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Daniel Bradley", "id": "ACM_author_81100174958"}, {"name": "Svein J. Knapskog", "id": "ACM_author_81100590587"}], "title": "Belief-based risk analysis", "keywords": ["belief calculus", "risk analysis", "security"], "year": 2004, "abstract": "This paper describes a method for risk analysis based on the approach used in CRAMM, but instead of using discrete measures for threats and vulnerabilities and look-up tables to derive levels of risk, it uses subjective beliefs about threats and vulnerabilities as input parameters, and uses the belief calculus of"}, "ACM_article_943124": {"authors": [{"name": "Theo Dimitrakos", "id": "ACM_author_81100323888"}, {"name": "Ivan Djordjevic", "id": "ACM_author_99659258914"}, {"name": "Zoran Milosevic", "id": "ACM_author_81100225502"}, {"name": "Audun Jsang", "id": "ACM_author_81100343007"}, {"name": "Chris I. Phillips", "id": "ACM_author_81100520614"}], "title": "Contract Performance Assessment for Secure and Dynamic Virtual Collaborations", "keywords": [], "year": 2003, "abstract": "In this paper we sketch a framework supporting contractenactment within the context of virtual organisation unitsthat are dynamically created in order to achieve a commonobjective by securely sharing resources, services andinformation. The framework is built on top of a jointextension of the policy deployment architecture for peer-to-peer communities that we"}, "ACM_article_1759021": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Shane Hird", "id": "ACM_author_81460651962"}, {"name": "Eric Faccer", "id": "ACM_author_81460655142"}], "title": "Simulating the effect of reputation systems on E-markets", "keywords": [], "year": 2003, "abstract": "Studies show that reputation systems have the potential to improve market quality. In this paper we report the results of simulating a market of trading agents that uses the beta reputation system for collecting feedback and computing agents' reputations. The simulation confirms the hypothesis that the presence of the reputation"}, "ACM_article_820105": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Mary Anne Patton", "id": "ACM_author_81100406382"}], "title": "User interface requirements for authentication of communication", "keywords": ["authentication", "security", "usability", "user interface", "non-repudiation"], "year": 2003, "abstract": "Authentication is a security service that consists of verifying that someone's identity is as claimed. There are a number of challenges to presenting information from the authentication process to the user in a way that is meaningful and ensures security. We show examples where authentication requirements are not met, due"}, "ACM_article_827993": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Gunnar Sanderud", "id": "ACM_author_81100014490"}], "title": "Security in mobile communications: challenges and opportunities", "keywords": ["mobile devices", "security", "usability", "heterogeneous networks"], "year": 2003, "abstract": "The nature of mobile communication, characterised for example by terminals having poor user interface and limited processing capacity, as well as complex combination of network protocols, makes the design of security solutions particularly challenging. This paper discusses some of the difficulties system architects are faced with as well as some"}, "ACM_article_604170": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "The consensus operator for combining beliefs", "keywords": ["Dempster's rule", "subjective logic", "belief", "conflict", "consensus operator"], "year": 2002, "abstract": "The consensus operator provides a method for combining possibly conflicting beliefs within the Dempster-Shafer belief theory, and represents an alternative to the traditional Dempster's rule. This paper describes how the consensus operator can be applied to dogmatic conflicting opinions, i.e., when the degree of conflict is very high. It overcomes"}, "ACM_article_650186": {"authors": [{"name": "Zoran Milosevic", "id": "ACM_author_81100225502"}, {"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Theodosis Dimitrakos", "id": "ACM_author_81100323888"}, {"name": "Mary Anne Patton", "id": "ACM_author_81100406382"}], "title": "Discretionary Enforcement of Electronic Contracts", "keywords": [], "year": 2002, "abstract": ""}, "ACM_article_787396": {"authors": [{"name": "Zoran Milosevic", "id": "ACM_author_81100225502"}, {"name": "Audun J\"sang", "id": "ACM_author_81100343007"}, {"name": "Theo Dimitrakos", "id": "ACM_author_81100323888"}, {"name": "Mary Anne Patton", "id": "ACM_author_81100406382"}], "title": "Discretionary Enforcement of Electronic Contracts", "keywords": [], "year": 2002, "abstract": "As in traditional commerce, parties to a contract in e-business environments areexpected to operate in good faith and comply with mutually agreed terms of contract. It may be the case however that deviation from the agreed contract obligations occur either intentionally or due to force majeur. In this paper we"}, "ACM_article_565981": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "A logic for uncertain probabilities", "keywords": ["reasoning", "belief", "evidence", "logic", "probability", "uncertainty"], "year": 2001, "abstract": ""}, "ACM_article_2698859": {"authors": [{"name": "Audun JØsang", "id": "ACM_author_81100343007"}, {"name": "Viggo A. Bondi", "id": "ACM_author_99658662554"}], "title": "Legal reasoning with subjective logic", "keywords": ["court", "probability", "artificial", "uncertainty", "law", "reasoning", "belief"], "year": 2000, "abstract": "Judges and jurors must make decisions in an environment of ignoranceand uncertainty for example by hearing statements of possibly unreliable ordishonest witnesses, assessing possibly doubtful or irrelevantevidence, and enduring attempts by the opponents to manipulate thejudge's and the jurors' perceptions and feelings. Three importantaspects of decision making in this environment"}, "ACM_article_678016": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "Ingar Glenn Pedersen", "id": "ACM_author_81100099962"}, {"name": "Dean Povey", "id": "ACM_author_81100048370"}], "title": "PKI Seeks a Trusting Relationship", "keywords": [], "year": 2000, "abstract": ""}, "ACM_article_713603": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}, {"name": "M. G. L. Bijnagte", "id": "ACM_author_81100536252"}, {"name": "G. Kleinhuis", "id": "ACM_author_81100193583"}], "title": "Enabling Factors for IN Service Provider Access", "keywords": [], "year": 1999, "abstract": ""}, "ACM_article_699329": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "A Subjective Metric of Authentication", "keywords": [], "year": 1998, "abstract": ""}, "ACM_article_687187": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "A Trust policy framework", "keywords": [], "year": 1997, "abstract": ""}, "ACM_article_677695": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "Prospectives for Modelling Trust in Information Security", "keywords": [], "year": 1997, "abstract": ""}, "ACM_article_278263": {"authors": [{"name": "A. Jøsang", "id": "ACM_author_81100343007"}, {"name": "F. Van Laenen", "id": "ACM_author_81100471148"}, {"name": "S. J. Knapskog", "id": "ACM_author_81100590587"}, {"name": "Joos Vandewalle", "id": "ACM_author_81100074844"}], "title": "How to trust systems", "keywords": ["assurance", "security", "trust", "security evaluation", "trusted systems"], "year": 1997, "abstract": ""}, "ACM_article_304877": {"authors": [{"name": "Audun Jøsang", "id": "ACM_author_81100343007"}], "title": "The right type of trust for distributed systems", "keywords": [], "year": 1996, "abstract": ""}, "ACM_article_214110": {"authors": [{"name": "Audun Josang", "id": "ACM_author_81100343007"}], "title": "The difficulty of standardizing smart card security evaluation", "keywords": ["illegal cloning", "smart cards", "assurance", "security through obscurity", "security validation", "ITSEC", "security evaluation", "standards"], "year": 1995, "abstract": ""}}